#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-iam.aws_iam_access_key.admin_macbook_pro will be created
  + resource "aws_iam_access_key" "admin_macbook_pro" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password    = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "admin-macbook-pro"
    }

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.670+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost_log will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost_log" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost-log"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost-log"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.345+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost-log"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-route-53.aws_route53_record.k8s_shunkakinoki_com_NS will be updated in-place
  ~ resource "aws_route53_record" "k8s_shunkakinoki_com_NS" {
        fqdn    = "k8s.shunkakinoki.com"
        id      = "Z1YVH3KJJ7OA0H_k8s.shunkakinoki.com_NS"
        name    = "k8s.shunkakinoki.com"
      ~ records = [
          + "ns-1323.awsdns-37.org",
          - "ns-1323.awsdns-37.org.",
          + "ns-1723.awsdns-23.co.uk",
          - "ns-1723.awsdns-23.co.uk.",
          + "ns-202.awsdns-25.com",
          - "ns-202.awsdns-25.com.",
          + "ns-753.awsdns-30.net",
          - "ns-753.awsdns-30.net.",
        ]
        ttl     = 172800
        type    = "NS"
        zone_id = "Z1YVH3KJJ7OA0H"
    }

  # module.aws-route-53.aws_route53_zone.k8s_shunkakinoki will be updated in-place
  ~ resource "aws_route53_zone" "k8s_shunkakinoki" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
        id            = "Z1YVH3KJJ7OA0H"
        name          = "k8s.shunkakinoki.com."
        name_servers  = [
            "ns-1323.awsdns-37.org",
            "ns-1723.awsdns-23.co.uk",
            "ns-202.awsdns-25.com",
            "ns-753.awsdns-30.net",
        ]
        tags          = {}
        zone_id       = "Z1YVH3KJJ7OA0H"
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
